Catalogs/ОбособленныеПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ОбособленныеПодразделенияОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляНалоговыхДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОбособленныеПодразделенияОрганизаций/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
// Обработчик события ПриИзменении элемента формы Наименование.
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	Если ПустаяСтрока(Объект.НаименованиеДляНалоговыхДокументов) Тогда
		Объект.НаименованиеДляНалоговыхДокументов = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// проверям, чтобы префикс был числовым. На формат не влияем
	Попытка
		
		ПрефиксЧисловой = Число(ТекущийОбъект.Префикс);
		Если ПрефиксЧисловой < 0  Тогда
			ПрефиксЧисловой = - ПрефиксЧисловой;
		КонецЕсли;
		
		// ТекущийОбъект.Префикс = Формат(ПрефиксЧисловой,"ЧЦ=4; ЧВН=; ЧГ=" );
		
	Исключение
		
		ТекущийОбъект.Префикс = "";
		
	КонецПопытки;
	
КонецПроцедуры
